<!-- dflook/terraform-github-actions {"workspace":"default","backend":"4dd55e9060cf610fee3f2f22cd300eb20e8910a0e509e9f2f5d2145898815697","backend_type":"s3","plan_job_ref":"Job Terraform plan #15 at https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/8317753161","plan_hash":"70498ebe2b077cb602dc476dc0476bac95392f49502e8578e3aa04ee61d80b49","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.kraken-dca-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-dca-lambda" {
        id                             = "kraken-dca-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:103",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.kraken-withdraw-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-withdraw-lambda" {
        id                             = "kraken-withdraw-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:103",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.kraken_dca_dependencies will be created
  + resource "aws_lambda_layer_version" "kraken_dca_dependencies" {
      + arn                         = (known after apply)
      + created_date                = (known after apply)
      + filename                    = "layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "kraken_dca_dependencies"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "4RBbeRj/t8CozluRTJoSNp/H5PAOyjJxb/6wlxmgLPw="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #15](https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/8317753161)